; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	image2 - mode
	thermograph3 - mode
	thermograph0 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star5 - direction
	GroundStation2 - direction
	Star0 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image2)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon8 thermograph3)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 infrared1)
	(have_image Star11 thermograph3)
	(have_image Star12 thermograph0)
	(have_image Star13 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation2 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 8
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 8
3. (calibrate satellite1 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 1 of 8
4. (turn_to satellite1 planet9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet9)
   goals met: 1 of 8
5. (take_image satellite1 planet9 instrument4 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 2 of 8
6. (turn_to satellite1 phenomenon8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 8
7. (take_image satellite1 phenomenon8 instrument4 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 3 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
9. (calibrate satellite0 instrument0 star6)
   added: (calibrated instrument0)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 8
11. (take_image satellite0 phenomenon10 instrument0 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 3 of 8
12. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 8
13. (take_image satellite0 phenomenon7 instrument0 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 4 of 8
14. (turn_to satellite0 star6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star6)
   goals met: 5 of 8
15. (turn_to satellite1 star11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star11)
   goals met: 5 of 8
16. (take_image satellite1 star11 instrument4 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 6 of 8
17. (turn_to satellite1 star12 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star12)
   goals met: 6 of 8
18. (take_image satellite1 star12 instrument4 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 7 of 8
19. (turn_to satellite1 star13 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star13)
   goals met: 7 of 8
20. (take_image satellite1 star13 instrument4 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 8 of 8
